#include <stdio.h>

int main()
{
    // 整形数组的初始化
    int arrayInt[10] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};

    // 字符型数组的初始化
    // 无尺寸数组，C 自动完成计算数组大小的工作
    char arrayChar1[] = "How are you?";
    char arrayChar2[13] = "How are you?";
    char arrayChar3[13] = {'H', 'o', 'w',
    ' ', 'a', 'r', 'e', ' ', 'y', 'o', 'u', '!', '\0'};

    int array2D[4][4] = {
        {12, 18, 6, 25},
        {23, 10, 32, 16},
        {25, 63, 1, 63},
        {0, 0, 27, 98}
    };

    // 对于二维无尺寸数组的初始化，数组
    // 第二个下标的尺寸是必须给出的
    int array2Dx6[][2] = {
        {1, 50},
        {45, 2},
        {2, 0},
        {12, 32},
        {42, 33},
        {15, 18}
    };
    return 0;
}